# CenterCurve Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..CenterCurve Property
StructuralElementDefinitionData Class See Also
---
The curve lying in the geometrical center of the element.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Curve CenterCurve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CenterCurve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ CenterCurve {
	Curve^ get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace